[AdventShieldbearerArmor X2ArmorTemplate]
FriendlyName="ADVENT Shieldbearer Armor"
FriendlyNamePlural="ADVENT Shieldbearer Armors"
BriefSummary="The shieldbearer's armor contains advanced shielding technology. After several failed attempts to reverse engineer the energy shield generators, we are unable to adapt the technology to other applications beyond this suit of armor. Part of the difficulty is in the limited availability of samples and a very complex deactivation protocol that we have been unable to crack. Each attempt results in a lost generator. At this point I recommend we settle for reinstating them without extracting cores from the refurbished armor."
TacticalText="<Bullet/>The shieldbearer's armor contains advanced shielding technology. After several failed attempts to reverse engineer the energy shield generators, we are unable to adapt the technology to other applications beyond this suit of armor. Part of the difficulty is in the limited availability of samples and a very complex deactivation protocol that we have been unable to crack. Each attempt results in a lost generator. At this point I recommend we settle for reinstating them without extracting cores from the refurbished armor."


[AdventShieldbearerArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."


[AdventShieldbearerArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Heavy Defenses"
LocLongDescription="The ADVENT Shieldbearer's armor offers increased armor protection and an innate shield generator"
LocHelpText="The ADVENT Shieldbearer's armor offers increased armor and an innate shield generator"
LocFlyOverText="The ADVENT Shieldbearer's armor offers increased armor and an innate shield generator"
LocPromotionPopupText="<Bullet/> The ADVENT Shieldbearer's armor offers increased armor and an innate shield generator"
